stressTest/mongoGetTest.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 30
      arrivalRate: 10
      rampTo: 100
    - duration: 60
      arrivalRate: 100
  processor: "./createTestID.js"
scenarios:
  - flow:
    # - loop:
      - function: "createTestID"
      - get:
          url: "/collection/mongo/{{id}}"
      # - log: "get {{id}}"
      # count: 400