stressTest/mongoGetTest.yml
config:
  target: 'http://localhost:3002'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 10
    - duration: 60
      arrivalRate: 10
  processor: "./createTestID.js"
scenarios:
  - flow:
    - loop:
      - function: "createTestID"
      - get:
          url: "/collection/mongo/{{id}}"
      # - log: "get {{id}}"
      count: 150